In [21]:
import pandas as pd
# pd.read_csv('ml-100k/u.item', sep='|', names=m_cols , encoding='latin-1')
df = pd.read_csv('Book1.csv')
df.head(10)

   Serial Number Name  Height (in inches)  Age  Phone number
0              1   AA               142.0   10     100000001
1              2   AB               143.0   11     100000002
2              3   AC               145.0   12     100000003
3              4   AD               172.0   13     100000004
4              5   AE               147.0   14     100000005
5              6   AF               148.5   15     100000006
6              7   AG               149.8   16     100000007
7              8   AH               151.1   17     100000008
8              9   AI               152.4   18     100000009
9             10   AJ               153.7   19     100000010

In [16]:
[df['Serial Number'][i] for i in range(len(df))]

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50]

In [20]:
df[:0]

Empty DataFrame
Columns: [Serial Number, Name, Height (in inches), Age, Phone number]
Index: []